[{"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "This metal, already worth $1,350 per gram, will be depleted on Earth by 2026, causing its price to skyrocket even further. - Farmingdale Observer", "description": "The world's rarest metal, osmium, has captivated both investors and luxury markets with its extraordinary value of €1,350 per gram. Recent developments suggest this precious element may become even more scarce, potentially triggering a significant price surge…", "url": "https://farmingdale-observer.com/2025/05/11/this-metal-already-worth-1350-per-gram-will-be-depleted-on-earth-by-2026-causing-its-price-to-skyrocket-even-further/", "urlToImage": null, "publishedAt": "2025-05-11T21:36:00Z", "content": "The world’s rarest metal, osmium, has captivated both investors and luxury markets with its extraordinary value of 1,350 per gram. Recent developments suggest this precious element may become even mo… [+4513 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "David J. Lynch", "title": "This Los Angeles port is among the first casualties of Trump’s trade war - The Washington Post", "description": "The number of shipping containers that sailed into the nation’s top container port last week was roughly one-third lower than during the same period last year.", "url": "https://www.washingtonpost.com/business/2025/05/11/los-angeles-port-tariffs-trade-tensions/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/VZXSJF4AEGRIF6SX6KWHK6M2MQ.JPG&w=1440", "publishedAt": "2025-05-11T21:31:04Z", "content": "LOS ANGELES On a sunny spring morning, when the Port of Los Angeles should be a blur of activity, more than half of the container ship berths here sit empty. The steel booms on dozens of towering shi… [+9405 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Viola Flowers", "title": "Listeria outbreak hospitalizes at least 10 in California and Nevada - NBC News", "description": "At least 10 people have been hospitalized in California and Nevada following a listeria outbreak under investigation by the Food and Drug Administration and the Centers for Disease Control and Prevention, the FDA said in a release Saturday.", "url": "https://www.nbcnews.com/news/us-news/listeria-outbreak-california-nevada-rcna206131", "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250511-fresh-and-ready-sandwich-vl-257p-a0c5d9.jpg", "publishedAt": "2025-05-11T20:05:57Z", "content": "At least 10 people have been hospitalized in California and Nevada following a listeria outbreak under investigation by the Food and Drug Administration and the Centers for Disease Control and Preven… [+2162 chars]"}, {"source": {"id": null, "name": "TheStreet"}, "author": "Daniel Kline", "title": "Costco makes fixing key member pain point a top priority - TheStreet", "description": "The warehouse club is devoting resources to make a poor part of the customer experience better.", "url": "https://www.thestreet.com/retail/costco-makes-fixing-key-member-pain-point-a-top-priority", "urlToImage": "https://www.thestreet.com/.image/ar_1.91%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_1200/MTkxNDAyMjA3NTc5NDgxNjMz/costco2.jpg", "publishedAt": "2025-05-11T19:33:00Z", "content": "Costco spares most expense when it comes to offering any sort of frills. The warehouse club generally does not spend money on things which do not directly translate to lower prices for members.\r\nThat… [+3483 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Naomi Tajitsu, Anya Andrianova, Elena Popina", "title": "Markets to Decide If Words Are Enough After US-China Trade Talks - Bloomberg", "description": "Financial markets will reopen needing to decide if warm words are as good as action after trade talks between the US and China ended with President Donald Trump’s advisers declaring “substantial progress” had been made, yet without providing many details.", "url": "https://www.bloomberg.com/news/articles/2025-05-11/markets-to-decide-if-words-are-enough-after-us-china-trade-talks", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iQ_0VtFNdlyM/v1/1200x800.jpg", "publishedAt": "2025-05-11T19:22:52Z", "content": "Financial markets will reopen needing to decide if warm words are as good as action after trade talks between the US and China ended with President Donald Trumps advisers declaring substantial progre… [+492 chars]"}]